
var studentData = {
  "data":[
    ["陆胤燊",21,0.03,249,75.37,63.53,0],
    ["刘大林",16,0.02,249,3.64,1.4,0],
    ["陈怡婕",9,0.01,249,2.78,0.02,0],
    ["阳金菊",0,0,249,0,0,0],
    ["梅琪",14,0.02,249,1.82,0.03,0],
    ["虞梅",12,0.02,249,2.03,0.01,0],
    ["KuoChaoCheng",7,0.13,249,3.43,0,0],
    ["张书范",10,0.01,249,2.4,0,0],
    ["项丽",10,0.01,249,2.53,0.04,0],
    ["王蕾",9,0.01,249,2.67,0,0],
    ["褚宏霞",7,0.01,249,3.46,0,0],
    ["刘霖",14,0.02,249,1.76,0.01,0],
    ["JJ",0,0,249,0,0,0],
    ["王慧",11,0.01,249,2.21,0.01,0],
    ["科教科管理员",5,0.91,249,4.8,0,0],
    ["陈敏",18,0.02,249,1.41,0.04,0],
    ["123ww",25,0.23,249,1.67,0.42,0],
    ["陆慧萍",3,"<0.01",249,8,0,0],
    ["赵莹",10,0.01,249,3.4,0.41,0],
    ["黄惠婷",8,0.01,249,3.01,0,0],
    ["刘司",7,0.01,249,3.45,0.01,0],
    ["杜燕",5,0.01,249,4.81,0,0],
    ["aaa345",1,0.02,249,24,0,0],
    ["胡明泰",20,0.03,249,1.26,0.04,0],
    ["赵慈宝",15,0.02,249,1.62,0,0],
    ["郭昭成",0,0,249,0,0,0],
    ["朱娓",21,0.03,249,1.15,0,0],
    ["闫铭",43,0.06,249,0.56,0,0],
    ["Frank",0,0,249,0,0,0],
    ["戈家霖",5,0.05,249,4.86,0.01,0.01],
    ["潘鑫",26,0.03,249,1.21,0.21,0],
    ["陈穹",14,0.02,249,2.25,0.3,0],
    ["刘慧黎",13,0.02,249,1.87,0,0],
    ["王贝贝",3,0.01,249,8,0,0],
    ["程东群",5,0.01,249,4.86,0.01,0],
    ["高勇梁",4,0.01,249,6.03,0,0],
    ["施仁桦",14,0.02,249,208.88,120.79,0],
    ["金妮",11,0.01,249,2.59,0.11,0],
    ["阴鹏鸽",13,0.02,249,1.87,0.01,0],
    ["李颖",14,0.02,249,4.27,0.73,0.01],
    ["龙继贤",21,0.03,249,1.99,0.45,0],
    ["testuser",0,0,249,0,0,0],
    ["邓文宗",0,0,249,0,0,0],
    ["王婷婷",18,0.02,249,3.36,0.99,0],
    ["韩荣丽",36,0.05,249,0.84,0.19,0],
    ["张见平",23,0.03,249,1.07,0.01,0],
    ["高珊珊",16,0.02,249,1.6,0.02,0],
    ["林婵",12,0.02,249,2.1,0.02,0],
    ["xxw",1,0.01,249,24.63,0.03,0.03],
    ["吴玲",17,0.02,249,1.49,0.02,0],
    ["test",0,0,249,0,0,0],
    ["朱亚萍",13,0.02,249,1.85,0,0],
    ["陈小平",18,0.02,249,1.4,0.01,0],
    ["娄俊婧",10,0.01,249,57.41,22.92,0],
    ["test",0,0,249,0,0,0],
    ["王萍萍",11,0.01,249,2.2,0.01,0],
    ["周勇",19,0.02,249,1.27,0,0],
    ["陈小青",18,0.02,249,1.38,0.02,0],
    ["Randy",0,0,249,0,0,0],
    ["黄优杰",3,"<0.01",249,8.01,0,0],
    ["章怡",15,0.02,249,1.68,0.02,0],
    ["曾惠玲",5,0.01,249,4.81,0,0],
    ["倪瑞英",5,0.01,249,4.81,0,0],
    ["王小玉",5,0.01,249,4.82,0,0],
    ["苑天文",0,0,249,0,0,0],
    ["李木子",113,1,249,1.03,1.51,0],
    ["郑晓辉",17,0.02,249,1.44,0.02,0],
    ["陳耳東",0,0,249,0,0,0],
    ["hola",0,0,249,0,0,0],
    ["成伟忠",9,0.01,249,4.62,0.73,0],
    ["崔剑巍",18,0.02,249,1.4,0.03,0],
    ["叶玲",29,0.04,249,0.85,0.01,0],
    ["范怡慧",5,0.01,249,4.81,0,0],
    ["俞璇",27,0.04,249,0.92,0.01,0],
    ["朱道丽",19,0.03,249,1.34,0.04,0],
    ["护理部管理员",0,0,249,0,0,0],
    ["王佳彬",6,0.01,249,4.02,0,0],
    ["陈远星",19,0.02,249,2.1,0.6,0],
    ["王倩倩",6,0.01,249,4,0,0],
    ["蔡旻",6,0.01,249,4.1,0.02,0],
    ["王玉",12,0.02,249,2.12,0.05,0],
    ["王岭",14,0.02,249,1.75,0.01,0],
    ["护理科学员",0,0,249,0,0,0],
    ["徐珊珊",19,0.03,249,1.51,0.17,0],
    ["翟颖",6,0.01,249,4.03,0.01,0],
    ["杜月婷",15,0.02,249,1.64,0.01,0],
    ["王伏燕",20,0.02,249,1.21,0,0],
    ["阮晓蓉",18,0.02,249,1.34,0,0],
    ["陆愉",19,0.03,249,1.27,0,0],
    ["沈燕",0,0,249,0,0,0],
    ["史小燕",19,0.02,249,1.46,0.07,0],
    ["张倩",14,0.02,249,1.72,0,0],
    ["何肖肖",15,0.02,249,1.61,0,0],
    ["杨玉华",11,0.01,249,2.2,0,0],
    ["丁玲",25,0.03,249,1.01,0.03,0],
    ["董芳婷",18,0.02,249,1.36,0.01,0],
    ["翟静芬",19,0.02,249,1.32,0.01,0],
    ["张玉洁",5,0.01,249,4.8,0,0],
    ["黄琳",37,0.05,249,0.7,0.04,0],
    ["曾满琴",11,0.01,249,2.2,0,0],
    ["曾燕林",18,0.02,249,1.33,0,0],
    ["李峰",18,0.02,249,1.35,0,0],
    ["马骏驰",16,0.02,249,1.56,0.04,0],
    ["张静",11,0.02,249,2.33,0.06,0],
    ["丁元",27,0.04,249,0.92,0,0],
    ["医务科学员",0,0,249,0,0,0],
    ["曾洁",11,0.01,249,2.26,0.03,0],
    ["杨帅",22,0.03,249,1.11,0.01,0],
    ["孙杰",7,0.01,249,3.44,0,0],
    ["俞若薇",21,0.03,249,1.34,0.09,0],
    ["科教科学员",0,0,249,0,0,0],
    ["周慧",4,0.01,249,6.01,0,0],
    ["韩越",13,0.02,249,1.86,0,0],
    ["吴艳萍",9,0.01,249,2.69,0,0],
    ["宋佳利",13,0.02,249,1.87,0.01,0],
    ["admin",204,0.24,249,0.38,0.5,0],
    ["林婕",0,0,249,0,0,0],
    ["倪瑞瑛",0,0,249,0,0,0],
    ["郝达彬",0,0,249,0,0,0],
    ["胡婉莹",0,0,249,0,0,0],
    ["尹雪",0,0,249,0,0,0],
    ["徐佳玲",0,0,249,0,0,0]
  ],
  "total":122,
  "aggregates":null
}

// 資料格式：0.姓名, 1.登入次数, 2.登入频率(次/天), 3.学习总学分, 4.登入平均时长(时/次), 5.最长时间(天), 6.最短时间(天)

var IntStudentNumber = studentData.data.length;

var studentNameList = []
  for(let i = 0 ; i< IntStudentNumber ; i++){
    studentNameList.push(studentData.data[i][0])
  }

var totalLoginTimes = [];
  for(let i = 0 ; i< IntStudentNumber ; i++){
    totalLoginTimes.push(studentData.data[i][1])
  }

var loginFrequence = [];
  for(let i = 0 ; i< IntStudentNumber ; i++){
    loginFrequence.push(studentData.data[i][2])
  }

var averageLoginTime = [];
  for(let i = 0 ; i< IntStudentNumber ; i++){
    averageLoginTime.push(studentData.data[i][4])
  }

var mostLongTime = [];
  for(let i = 0 ; i< IntStudentNumber ; i++){
    mostLongTime.push(studentData.data[i][5])
  }

var mostShortTime = [];
  for(let i = 0 ; i< IntStudentNumber ; i++){
    mostShortTime.push(studentData.data[i][6])
  }

// 繪製chartJS圖表

var myChart             
function render() {
  var canvas = document.getElementById('myChart').getContext('2d');
  myChart = new Chart(canvas, {
    type: 'bar',
    data: {
      labels: studentNameList,
      datasets: [{
        label: '登入次數',
        data: totalLoginTimes,
      }]
    },
    options: {
      plugins: {  
        labels: { //用plugin顯示上方數據
          render:'value'
        }
      },
      layout: { //設定圖表本身上方的padding
        padding: {          
          top: 30
        }
      },
      legend: { //把catagory註釋位置移到左側
        position: 'left',
        onClick:function() { return false }
      },
      maintainAspectRatio: false,
    },
  });
}
render()

// 更新圖表
function ChartUpdate(newYaxisData,labelName) {
  myChart.config.data.datasets[0].label = labelName;
  myChart.config.data.datasets[0].data = newYaxisData;
  myChart.update();
}

function changeChart(id) {
  switch(id) {
    case 1:
      ChartUpdate(totalLoginTimes, "登入次數")
      break;
    case 2:
      ChartUpdate(loginFrequence, "登入頻率")
      break;
    case 3:
      ChartUpdate(averageLoginTime, "登入平均時長（時/次）")
      break;
    case 4:
      ChartUpdate(mostLongTime, "最長時間(天)")
      break;
    case 5:
      ChartUpdate(mostShortTime, "最短时间(天)")
      break;
  }
};