
var studentData = {
  "data": [
    ["xx医院","陆胤燊",21,75.37,0,0,96,249,7],
    ["xx医院","刘大林",16,3.64,0,0,98.29,249,6],
    ["xx医院","陈怡婕",9,2.78,0,0,96.09,249,7],
    ["xx医院","阳金菊",0,0,0,0,0,249,"不適用"],
    ["xx医院","梅琪",14,1.82,0,0,94.06,249,7],
    ["xx医院","虞梅",12,2.03,0,0,100,249,],
    ["xx医院","KuoChaoCheng",7,3.43,0,0,0,249,"不適用"],
    ["xx医院","张书范",10,2.4,0,0,100,249,1],
    ["xx医院","项丽",10,2.53,0,0,100,249,],
    ["xx医院","王蕾",9,2.67,0,0,100,249,2],
    ["xx医院","褚宏霞",7,3.46,0,0,99.38,249,5],
    ["xx医院","刘霖",14,1.76,0,0,92.22,249,7],
    ["xx医院","JJ",0,0,0,0,0,249,"不適用"],
    ["xx医院","王慧",11,2.21,0,0,100,249,2],
    ["xx医院","科教科管理员",5,4.8,26,0.92,0.46,249,9],
    ["xx医院","陈敏",18,1.41,0,0,97.07,249,6],
    ["xx医院","123ww",25,1.67,2,1,0,249,9],
    ["xx医院","陆慧萍",3,8,0,0,100,249,2],
    ["xx医院","赵莹",10,3.4,0,0,100,249,1],
    ["xx医院","黄惠婷",8,3.01,0,0,100,249,],
    ["xx医院","刘司",7,3.45,0,0,100,249,2],
    ["xx医院","杜燕",5,4.81,0,0,100,249,2],
    ["xx医院","aaa345",1,24,0,0,0,249,"不適用"],
    ["xx医院","胡明泰",20,1.26,0,0,99.94,249,3],
    ["xx医院","赵慈宝",15,1.62,0,0,100,249,1],
    ["xx医院","郭昭成",0,0,0,0,0,249,"不適用"],
    ["xx医院","朱娓",21,1.15,0,0,99.88,249,3],
    ["xx医院","闫铭",43,0.56,0,0,98.85,249,5],
    ["xx医院","Frank",0,0,0,0,0,249,"不適用"],
    ["xx医院","戈家霖",5,4.86,0,0,0,249,"不適用"],
    ["xx医院","潘鑫",26,1.21,0,0,94,249,7],
    ["xx医院","陈穹",14,2.25,0,0,98.83,249,5],
    ["xx医院","刘慧黎",13,1.87,0,0,98.63,249,6],
    ["xx医院","王贝贝",3,8,0,0,95,249,7],
    ["xx医院","程东群",5,4.86,0,0,99.5,249,4],
    ["xx医院","高勇梁",4,6.03,0,0,99,249,5],
    ["xx医院","施仁桦",14,208.88,0,0,99.17,249,5],
    ["xx医院","金妮",11,2.59,0,0,99.09,249,5],
    ["xx医院","阴鹏鸽",13,1.87,0,0,100,249,1],
    ["xx医院","李颖",14,4.27,0,0,99.94,249,3],
    ["xx医院","龙继贤",21,1.99,0,0,99,249,5],
    ["xx医院","testuser",0,0,0,0,0,249,"不適用"],
    ["xx医院","邓文宗",0,0,0,0,0,249,"不適用"],
    ["xx医院","王婷婷",18,3.36,0,0,94.94,249,7],
    ["xx医院","韩荣丽",36,0.84,0,0,99.63,249,4],
    ["xx医院","张见平",23,1.07,0,0,100,249,],
    ["xx医院","高珊珊",16,1.6,0,0,98,249,6],
    ["xx医院","林婵",12,2.1,0,0,98.47,249,6],
    ["xx医院","xxw",1,24.63,0,0,0,249,9],
    ["xx医院","吴玲",17,1.49,0,0,99.57,249,4],
    ["xx医院","test",0,0,0,0,0,249,"不適用"],
    ["xx医院","朱亚萍",13,1.85,0,0,99.67,249,3],
    ["xx医院","陈小平",18,1.4,0,0,98.75,249,6],
    ["xx医院","娄俊婧",10,57.41,0,0,100,249,2],
    ["xx医院","test",0,0,0,0,0,249,"不適用"],
    ["xx医院","王萍萍",11,2.2,0,0,99,249,5],
    ["xx医院","周勇",19,1.27,0,0,99.83,249,3],
    ["xx医院","陈小青",18,1.38,0,0,98.53,249,6],
    ["xx医院","Randy",0,0,0,0,0,249,"不適用"],
    ["xx医院","黄优杰",3,8.01,0,0,100,249,3],
    ["xx医院","章怡",15,1.68,0,0,83.75,249,8],
    ["xx医院","曾惠玲",5,4.81,0,0,91,249,8],
    ["xx医院","倪瑞英",5,4.81,0,0,92,249,8],
    ["xx医院","王小玉",5,4.82,0,0,100,249,3],
    ["xx医院","苑天文",0,0,0,0,0,249,"不適用"],
    ["xx医院","李木子",113,1.03,5,1,3.5,249,9],
    ["xx医院","郑晓辉",17,1.44,0,0,99.9,249,3],
    ["xx医院","陳耳東",0,0,0,0,0,249,"不適用"],
    ["xx医院","hola",0,0,0,0,0,249,"不適用"],
    ["xx医院","成伟忠",9,4.62,0,0,100,249,2],
    ["xx医院","崔剑巍",18,1.4,0,0,99.44,249,4],
    ["xx医院","叶玲",29,0.85,0,0,99.53,249,4],
    ["xx医院","范怡慧",5,4.81,0,0,100,249,1],
    ["xx医院","俞璇",27,0.92,0,0,99.85,249,3],
    ["xx医院","朱道丽",19,1.34,0,0,99.41,249,4],
    ["xx医院","护理部管理员",0,0,0,0,0,249,"不適用"],
    ["xx医院","王佳彬",6,4.02,0,0,100,249,"不適用"],
    ["xx医院","陈远星",19,2.1,0,0,98.15,249,6],
    ["xx医院","王倩倩",6,4,0,0,100,249,1],
    ["xx医院","蔡旻",6,4.1,0,0,99,249,5],
    ["xx医院","王玉",12,2.12,0,0,100,249,2],
    ["xx医院","王岭",14,1.75,0,0,99.55,249,4],
    ["xx医院","护理科学员",0,0,0,0,0,249,"不適用"],
    ["xx医院","徐珊珊",19,1.51,0,0,100,249,"不適用"],
    ["xx医院","翟颖",6,4.03,0,0,94.25,249,7],
    ["xx医院","杜月婷",15,1.64,0,0,86.32,249,8],
    ["xx医院","王伏燕",20,1.21,0,0,84.23,249,8],
    ["xx医院","阮晓蓉",18,1.34,0,0,99.71,249,3],
    ["xx医院","陆愉",19,1.27,0,0,92.14,249,8],
    ["xx医院","沈燕",0,0,0,0,0,249,"不適用"],
    ["xx医院","史小燕",19,1.46,0,0,90.93,249,8],
    ["xx医院","张倩",14,1.72,0,0,99.62,249,4],
    ["xx医院","何肖肖",15,1.61,0,0,68.17,249,9],
    ["xx医院","杨玉华",11,2.2,0,0,97.31,249,6],
    ["xx医院","丁玲",25,1.01,0,0,100,249,1],
    ["xx医院","董芳婷",18,1.36,0,0,92.07,249,8],
    ["xx医院","翟静芬",19,1.32,0,0,64.47,249,9],
    ["xx医院","张玉洁",5,4.8,0,0,100,249,2],
    ["xx医院","黄琳",37,0.7,0,0,99.54,249,4],
    ["xx医院","曾满琴",11,2.2,0,0,100,249,1],
    ["xx医院","曾燕林",18,1.33,0,0,92.88,249,7],
    ["xx医院","李峰",18,1.35,0,0,100,249,1],
    ["xx医院","马骏驰",16,1.56,0,0,96.24,249,7],
    ["xx医院","张静",11,2.33,0,0,100,249,],
    ["xx医院","丁元",27,0.92,0,0,77.24,249,8],
    ["xx医院","医务科学员",0,0,0,0,0,249,"不適用"],
    ["xx医院","曾洁",11,2.26,0,0,100,249,1],
    ["xx医院","杨帅",22,1.11,0,0,100,249,2],
    ["xx医院","孙杰",7,3.44,0,0,100,249,],
    ["xx医院","俞若薇",21,1.34,0,0,96.36,249,6],
    ["xx医院","科教科学员",0,0,0,0,0,249,"不適用"],
    ["xx医院","周慧",4,6.01,2,10,100,249,],
    ["xx医院","韩越",13,1.86,0,0,92.14,249,8],
    ["xx医院","吴艳萍",9,2.69,0,0,99.4,249,5],
    ["xx医院","宋佳利",13,1.87,0,0,99.5,249,4],
    ["xx医院","admin",204,0.38,0,0,0,249,"不適用"],
    ["oo医院","林婕",0,0,0,0,0,249,"不適用"],
    ["oo医院","倪瑞瑛",0,0,0,0,0,249,"不適用"],
    ["oo医院","郝达彬",0,0,0,0,0,249,"不適用"],
    ["oo医院","胡婉莹",0,0,0,0,0,249,"不適用"],
    ["oo医院","尹雪",0,0,0,0,0,249,"不適用"],
    ["oo医院","徐佳玲",0,0,0,0,0,249,"不適用"],
  ],
  "total": 124,
  "aggregates": null
}

// 資料格式：0.机构名称, 1.姓名, 2.登入次数,3.登入平均时长(时/次),4.登总练习次数, 5.练习平均分数, 6.考试平均分数, 8.考试成绩排名
var IntStudentNumber = studentData.data.length;

var studentNameList=[]
for(let i = 0 ; i< IntStudentNumber ; i++) {
  studentNameList.push(studentData.data[i][1])
}

var totalLoginTimes = [];
for(let i = 0 ; i< IntStudentNumber ; i++) {
  totalLoginTimes.push(studentData.data[i][2])
}

var averageLoginTime = [];
for(let i = 0 ; i< IntStudentNumber ; i++){
  averageLoginTime.push(studentData.data[i][3])
}

var TotalpracticeTimes = [];
for(let i = 0 ; i< IntStudentNumber ; i++){
  TotalpracticeTimes.push(studentData.data[i][4])
}

var AveragePracticeScore = [];
for(let i = 0 ; i< IntStudentNumber ; i++){
  AveragePracticeScore.push(studentData.data[i][5])
}

var AverageExamScore = [];
for(let i = 0 ; i< IntStudentNumber ; i++){
  AverageExamScore.push(studentData.data[i][6])
}

var gradesRanking = [];
for(let i = 0 ; i< IntStudentNumber ; i++){
  gradesRanking.push(studentData.data[i][8])
}

// 繪製chartJS圖表
var myChart
function render() {
  var canvas = document.getElementById('myChart').getContext('2d');
  myChart = new Chart(canvas, {
    type: 'bar',
    data: {
      labels: studentNameList,
      datasets: [{
        label: '登入次数',
        data: totalLoginTimes,
      }]
    },
    options: {
      plugins:{ 
        labels:{ //用plugin顯示上方數據
          render:'value'
        }
      },
      layout:{
        padding: {  //設定圖表本身上方的padding         
          top: 30
        }
      },
      legend: {  //把catagory註釋位置移到左側
        position: 'left',
        onClick:function() { return false }
      },
      maintainAspectRatio: false,
    },
  });
}
render()

// 圖表更新
function ChartUpdate(newYaxisData, labelName) {
  var Data = [{
    label:labelName,
    data: newYaxisData
  }]
  myChart.config.data.datasets = Data
  myChart.update();
}

var Score= [
  {
    label: "練習平均分數",
    backgroundColor: "pink",
    data: AveragePracticeScore
  },
  {
    label: "考試平均分數",
    backgroundColor: "gray",
    data: AverageExamScore
  }
]

function changeChart(id){
  switch(id){
    case 1:
      ChartUpdate(totalLoginTimes,"登入次数")
      break;
    case 2:
      ChartUpdate(averageLoginTime,"登入平均时长(时/次)")
      break;
    case 3:
      ChartUpdate(TotalpracticeTimes,"登总练习次数")
      break;
    case 4:
      myChart.config.data.datasets = Score;
      myChart.update();
      break;
    case 5:
      ChartUpdate(gradesRanking,"考试成绩排名")
      break;
  }
};
